In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv('massar.csv')

In [3]:
data.shape

(18241, 6)

In [4]:
data.head(10)

,Unnamed: 0,City,Colors Reported,Shape Reported,State,Time
0,0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00
1,1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00
2,2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00
3,3,Abilene,NaN,DISK,KS,6/1/1931 13:00
4,4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00
5,5,Valley City,NaN,DISK,ND,9/15/1934 15:30
6,6,Crater Lake,NaN,CIRCLE,CA,6/15/1935 0:00
7,7,Alma,NaN,DISK,MI,7/15/1936 0:00
8,8,Eklutna,NaN,CIGAR,AK,10/15/1936 17:00
9,9,Hubbard,NaN,CYLINDER,OR,6/15/1937 0:00

In [5]:
data

,Unnamed: 0,City,Colors Reported,Shape Reported,State,Time
0,0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00
1,1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00
2,2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00
3,3,Abilene,NaN,DISK,KS,6/1/1931 13:00
4,4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00
...,...,...,...,...,...,...
18236,18236,Grant Park,NaN,TRIANGLE,IL,12/31/2000 23:00
18237,18237,Spirit Lake,NaN,DISK,IA,12/31/2000 23:00
18238,18238,Eagle River,NaN,NaN,WI,12/31/2000 23:45
18239,18239,Eagle River,RED,LIGHT,WI,12/31/2000 23:45
18240,18240,Ybor,NaN,OVAL,FL,12/31/2000 23:59

In [6]:
data.dtypes

Unnamed: 0          int64
City               object
Colors Reported    object
Shape Reported     object
State              object
Time               object
dtype: object

In [7]:
data.describe()

         Unnamed: 0
count  18241.000000
mean    9120.000000
std     5265.867466
min        0.000000
25%     4560.000000
50%     9120.000000
75%    13680.000000
max    18240.000000

In [9]:
data.isna().sum()

Unnamed: 0             0
City                  25
Colors Reported    15359
Shape Reported      2644
State                  0
Time                   0
dtype: int64

In [10]:
del data['Unnamed: 0']

In [11]:
data.isna().sum()

City                  25
Colors Reported    15359
Shape Reported      2644
State                  0
Time                   0
dtype: int64

In [12]:
data.duplicated().sum()

109

In [13]:
data.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [14]:
data['Colors Reported'].isna().describe()

count     18241
unique        2
top        True
freq      15359
Name: Colors Reported, dtype: object

In [15]:
#Recherche de pourcentage des valeurs manquante
15364*100/18241

84.22783838605339

In [16]:
#suppression de la colonne comme les donnees manquantes depassent 50%
del data['Colors Reported']

In [17]:
data

                       City Shape Reported State              Time
0                    Ithaca       TRIANGLE    NY    6/1/1930 22:00
1               Willingboro          OTHER    NJ   6/30/1930 20:00
2                   Holyoke           OVAL    CO   2/15/1931 14:00
3                   Abilene           DISK    KS    6/1/1931 13:00
4      New York Worlds Fair          LIGHT    NY   4/18/1933 19:00
...                     ...            ...   ...               ...
18236            Grant Park       TRIANGLE    IL  12/31/2000 23:00
18237           Spirit Lake           DISK    IA  12/31/2000 23:00
18238           Eagle River            NaN    WI  12/31/2000 23:45
18239           Eagle River          LIGHT    WI  12/31/2000 23:45
18240                  Ybor           OVAL    FL  12/31/2000 23:59

[18241 rows x 4 columns]

In [18]:
data['Shape Reported'].fillna('VARIOUS',inplace=True)

In [19]:
data['Shape Reported'].isna().sum()

0

In [20]:
data.duplicated().sum()

149

In [21]:
data=data.drop_duplicates()

In [22]:
data.duplicated().sum()

0

In [23]:
data.describe()

           City Shape Reported  State              Time
count     18067          18092  18092             18092
unique     6476             27     52             16145
top     Seattle        VARIOUS     CA  11/16/1999 19:00
freq        182           2953   2513                27

In [24]:
#Renommer les colonnes 'Shape Reported' par 'Forme'
data.rename(columns={'Shape Reported':'Forme'},inplace=True)

C:\Users\PC\anaconda3\lib\site-packages\pandas\core\frame.py:4441: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().rename(

In [27]:
#réindexer les données selon l’ordre suivant : 'City', 'Forme','Couleur','State','Time'

colonnes=['City', 'Forme','State','Time']
new_data=data[colonnes]

In [28]:
new_data.rename(columns={'Time;':'Time'},inplace=True)

In [29]:
new_data.head()

                   City     Forme State             Time
0                Ithaca  TRIANGLE    NY   6/1/1930 22:00
1           Willingboro     OTHER    NJ  6/30/1930 20:00
2               Holyoke      OVAL    CO  2/15/1931 14:00
3               Abilene      DISK    KS   6/1/1931 13:00
4  New York Worlds Fair     LIGHT    NY  4/18/1933 19:00